Revit 2026 API

# RebarShapeVertex Properties

---

The RebarShapeVertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendAngle | The range of permissible angles at this bend. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Turn | The sense of the turn. The Turn property must be set to Left or Right on each internal vertex before the RebarShapeDefinitionBySegments is used. Default is permissible for the first and last vertex, since they do not correspond to bends. |

#### Reference

RebarShapeVertex Class

Autodesk.Revit.DB.Structure Namespace